<?xml version="1.0" ?>
<net name="RMNet_LReLU with SSD head for Action Detection and Action Recognition" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,400,680"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_44988/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/norm/bn/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_44990/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/norm/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="init_block1/dim_inc/bn/mean/Fused_Mul_4834148343_const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="32,3,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="init_block1/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_4499344998/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1740" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="init_block1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="init_block1/dim_inc/fn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="bottleneck1_1/dim_red/bn/mean/Fused_Mul_4834548347_const" type="Const" version="opset1">
			<data element_type="f16" offset="1804" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="bottleneck1_1/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_4500145006/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2316" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bottleneck1_1/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="bottleneck1_1/dim_red/fn58848/Cast_171215_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="bottleneck1_1/dim_red/fn58848" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="6980669809_const" type="Const" version="opset1">
			<data element_type="f16" offset="2336" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="bottleneck1_1/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_4500945014/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="2480" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="bottleneck1_1/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="bottleneck1_1/inner/dw1/fn58892/Cast_171251_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="bottleneck1_1/inner/dw1/fn58892" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="bottleneck1_1/dim_inc/bn/mean/Fused_Mul_4835348355_const" type="Const" version="opset1">
			<data element_type="f16" offset="2496" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="bottleneck1_1/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_4501745022/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3008" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="bottleneck1_1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="bottleneck1_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bottleneck1_1/fn58724/Cast_171353_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="bottleneck1_1/fn58724" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="bottleneck1_2/dim_red/bn/mean/Fused_Mul_4835748359_const" type="Const" version="opset1">
			<data element_type="f16" offset="3072" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="bottleneck1_2/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_4502545030/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3584" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="bottleneck1_2/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="bottleneck1_2/dim_red/fn59152/Cast_171259_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="bottleneck1_2/dim_red/fn59152" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="6968269685_const" type="Const" version="opset1">
			<data element_type="f16" offset="3600" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bottleneck1_2/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_4503345038/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3744" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bottleneck1_2/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bottleneck1_2/inner/dw1/fn58644/Cast_171273_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bottleneck1_2/inner/dw1/fn58644" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bottleneck1_2/dim_inc/bn/mean/Fused_Mul_4836548367_const" type="Const" version="opset1">
			<data element_type="f16" offset="3760" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="bottleneck1_2/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_4504145046/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="4272" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bottleneck1_2/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bottleneck1_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="bottleneck1_2/fn59188/Cast_171479_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="bottleneck1_2/fn59188" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bottleneck1_3/dim_red/bn/mean/Fused_Mul_4836948371_const" type="Const" version="opset1">
			<data element_type="f16" offset="4336" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="bottleneck1_3/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_4504945054/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="4848" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="bottleneck1_3/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="bottleneck1_3/dim_red/fn59016/Cast_171367_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="bottleneck1_3/dim_red/fn59016" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="6984269845_const" type="Const" version="opset1">
			<data element_type="f16" offset="4864" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bottleneck1_3/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_4505745062/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="5008" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bottleneck1_3/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="bottleneck1_3/inner/dw1/fn59000/Cast_171365_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bottleneck1_3/inner/dw1/fn59000" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="bottleneck1_3/dim_inc/bn/mean/Fused_Mul_4837748379_const" type="Const" version="opset1">
			<data element_type="f16" offset="5024" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bottleneck1_3/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_4506545070/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="5536" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="bottleneck1_3/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="bottleneck1_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="bottleneck1_3/fn58688/Cast_171191_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bottleneck1_3/fn58688" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="bottleneck1_4/dim_red/bn/mean/Fused_Mul_4838148383_const" type="Const" version="opset1">
			<data element_type="f16" offset="5600" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bottleneck1_4/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_4507345078/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6112" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="bottleneck1_4/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck1_4/dim_red/fn59100/Cast_171355_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="bottleneck1_4/dim_red/fn59100" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="6969469697_const" type="Const" version="opset1">
			<data element_type="f16" offset="6128" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="bottleneck1_4/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_4508145086/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6272" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="bottleneck1_4/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="bottleneck1_4/inner/dw1/fn58548/Cast_171197_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bottleneck1_4/inner/dw1/fn58548" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="bottleneck1_4/dim_inc/bn/mean/Fused_Mul_4838948391_const" type="Const" version="opset1">
			<data element_type="f16" offset="6288" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bottleneck1_4/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_4508945094/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6800" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bottleneck1_4/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="bottleneck1_4/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="bottleneck1_4/fn58812/Cast_171325_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck1_4/fn58812" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bottleneck2_0/skip/pooling" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="bottleneck2_0/skip/bn/mean/Fused_Mul_4839348395_const" type="Const" version="opset1">
			<data element_type="f16" offset="6864" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="bottleneck2_0/skip/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_add_4509745102/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="10960" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="bottleneck2_0/skip/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bottleneck2_0/dim_red/bn/mean/Fused_Mul_4839748399_const" type="Const" version="opset1">
			<data element_type="f16" offset="11088" shape="16,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bottleneck2_0/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_4510545110/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="12112" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="bottleneck2_0/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="bottleneck2_0/dim_red/fn59208/Cast_171439_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bottleneck2_0/dim_red/fn59208" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="6968669689_const" type="Const" version="opset1">
			<data element_type="f16" offset="12144" shape="16,1,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck2_0/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="data_add_4511345118/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="12432" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="bottleneck2_0/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck2_0/inner/dw1/fn59108/Cast_171497_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="bottleneck2_0/inner/dw1/fn59108" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="bottleneck2_0/dim_inc/bn/mean/Fused_Mul_4840548407_const" type="Const" version="opset1">
			<data element_type="f16" offset="12464" shape="64,16,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="bottleneck2_0/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_add_4512145126/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="14512" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="bottleneck2_0/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="bottleneck2_0/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="bottleneck2_0/fn58676/Cast_171359_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="bottleneck2_0/fn58676" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="bottleneck2_1/dim_red/bn/mean/Fused_Mul_4840948411_const" type="Const" version="opset1">
			<data element_type="f16" offset="14640" shape="16,64,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="bottleneck2_1/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="data_add_4512945134/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="16688" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="bottleneck2_1/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bottleneck2_1/dim_red/fn58712/Cast_171275_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="bottleneck2_1/dim_red/fn58712" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="6978269785_const" type="Const" version="opset1">
			<data element_type="f16" offset="16720" shape="16,1,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="bottleneck2_1/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="data_add_4513745142/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="17008" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="bottleneck2_1/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="bottleneck2_1/inner/dw1/fn58540/Cast_171307_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="bottleneck2_1/inner/dw1/fn58540" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="bottleneck2_1/dim_inc/bn/mean/Fused_Mul_4841748419_const" type="Const" version="opset1">
			<data element_type="f16" offset="17040" shape="64,16,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="bottleneck2_1/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
